ЖКХ/src/InformationRegisters/Тарифы/Тарифы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Тарифы</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РесурсУслуга</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/InformationRegisters/ТарифыИнтервальный/ТарифыИнтервальный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТарифыИнтервальный</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>РесурсУслуга</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыРесурсов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ЖКХ/src/InformationRegisters/Тарифы/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Количество() = 0 Тогда
		
		// Это удаление
		РесурсУслуга = Отбор.РесурсУслуга.Значение;
		Период = Отбор.Период.Значение;
		
		ПредЗапись = ЗаписьДляРедактирования(РесурсУслуга, Период);
		
		Если НЕ ПредЗапись = Неопределено Тогда
			
			Набор = РегистрыСведений.ТарифыИнтервальный.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(ПредЗапись.ДатаНачала);
			Набор.Отбор.РесурсУслуга.Установить(ПредЗапись.РесурсУслуга);
			Набор.Прочитать();
			РедактируемаяЗапись = Набор[0];
			РедактируемаяЗапись.ДатаОкончания = ПредЗапись.ДатаОкончания;
			Набор.Записать();
			
		КонецЕсли;
		
		Набор = РегистрыСведений.ТарифыИнтервальный.СоздатьНаборЗаписей();
		Набор.Отбор.ДатаНачала.Установить(Период);
		Набор.Отбор.РесурсУслуга.Установить(РесурсУслуга);
		Набор.Прочитать();
		
		Если Не Набор.Количество() = 0 Тогда
			
			Набор.Удалить(0);
			Набор.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
	Для каждого ЗаписьРегистра из ЭтотОбъект Цикл
		
		ОтборЗаписи = Новый Структура("РесурсУслуга", ЗаписьРегистра.РесурсУслуга);
		КрайняяЗапись = РегистрыСведений.ТарифыИнтервальный.СрезПоследних(ЗаписьРегистра.Период, ОтборЗаписи);
		
		Если КрайняяЗапись = Неопределено Тогда
			
			Набор = РегистрыСведений.ТарифыИнтервальный.СоздатьМенеджерЗаписи();
			Набор.Период = ЗаписьРегистра.Период;
			Набор.РесурсУслуга = ЗаписьРегистра.РесурсУслуга;
			Набор.Прочитать();
			
			Набор.Период = ЗаписьРегистра.Период;
			Набор.ДатаНачала = ЗаписьРегистра.Период;
			Набор.РесурсУслуга = ЗаписьРегистра.РесурсУслуга;
			Набор.Тариф = ЗаписьРегистра.Тариф;
			
			Набор.Записать();
			
		Иначе
			
			Если КрайняяЗапись[0].Период >= ЗаписьРегистра.Период Тогда
				
				Продолжить;
				
			КонецЕсли;
			
			Набор = РегистрыСведений.ТарифыИнтервальный.СоздатьНаборЗаписей();
			Набор.Отбор.Период.Установить(КрайняяЗапись[0].Период);
			Набор.Отбор.РесурсУслуга.Установить(ЗаписьРегистра.РесурсУслуга);
			Набор.Прочитать();
			
			Запись = Набор[0];
			ДатаОкончания = Запись.ДатаОкончания;
			Запись.ДатаОкончания = ЗаписьРегистра.Период - 1;
			
			Набор.Записать(РежимЗамещения.Обновление);
			
			Менеджер = РегистрыСведений.ТарифыИнтервальный.СоздатьМенеджерЗаписи();
			Менеджер.Период = ЗаписьРегистра.Период;
			Менеджер.РесурсУслуга = ЗаписьРегистра.РесурсУслуга;
			Менеджер.Прочитать();
			
			Менеджер.Период = ЗаписьРегистра.Период;
			Менеджер.ДатаНачала = ЗаписьРегистра.Период;
			Менеджер.ДатаОкончания = ДатаОкончания;
			Менеджер.РесурсУслуга = ЗаписьРегистра.РесурсУслуга;
			Менеджер.Тариф = ЗаписьРегистра.Тариф;
			
			Менеджер.Записать();
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ЗаписьДляРедактирования(РесурсУслуга, Период)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", Период);
	Запрос.УстановитьПараметр("РесурсУслуга", РесурсУслуга);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Т.РесурсУслуга КАК РесурсУслуга,
	               |	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(Т.ДатаНачала, СЕКУНДА, -1), ДЕНЬ) КАК НоваяДатаОкончания,
	               |	Т.ДатаОкончания КАК СтараяДатаОкончания
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	РегистрСведений.ТарифыИнтервальный КАК Т
	               |ГДЕ
	               |	Т.РесурсУслуга = &РесурсУслуга
	               |	И Т.ДатаНачала = &ДатаНачала
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Т.РесурсУслуга КАК РесурсУслуга,
	               |	Т.ДатаНачала КАК ДатаНачала,
	               |	ВТ.СтараяДатаОкончания КАК ДатаОкончания
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТарифыИнтервальный КАК Т
	               |		ПО ВТ.РесурсУслуга = Т.РесурсУслуга
	               |			И (Т.ДатаОкончания = ВТ.НоваяДатаОкончания)
	               |ГДЕ
	               |	НЕ Т.РесурсУслуга ЕСТЬ NULL";
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() = 0 Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		СтрокаСтруктура = Новый Структура("РесурсУслуга, ДатаНачала, ДатаОкончания");
		СтрокаСтруктура.РесурсУслуга = РезультатЗапроса.РесурсУслуга;
		СтрокаСтруктура.ДатаНачала = РезультатЗапроса.ДатаНачала;
		СтрокаСтруктура.ДатаОкончания = РезультатЗапроса.ДатаОкончания;
		
	КонецЦикла;
	
	Возврат СтрокаСтруктура;
	
КонецФункции
